zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxe/pinctrl/MCXE31BMPB-pinctrl.h
#define PTD30_EMIOS_2_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 126, 4, 0, 0)
#define PTD30_LPSPI5_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 126, 0, 265, 1)
#define PTD30_LPSPI5_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 126, 6, 0, 0)
#define PTD31_EMIOS_2_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 127, 0, 134, 4)
#define PTD31_EMIOS_2_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 127, 4, 0, 0)
#define PTD4_LPSPI5_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 100, 0, 262, 2)
#define PTD4_LPSPI5_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 100, 7, 0, 0)
#define PTD5_EMAC_MII_RX_CLK            NXP_SIUL2_PINMUX(0, 0, 101, 0, 300, 2)
#define PTD5_EMAC_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 101, 1, 0, 0)
#define PTD5_EMAC_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 101, 5, 0, 0)
#define PTD6_EMAC_MII_RMII_TX_CLK       NXP_SIUL2_PINMUX(0, 0, 102, 0, 296, 2)
#define PTD6_EMAC_MII_TXD2              NXP_SIUL2_PINMUX(0, 0, 102, 5, 0, 0)
#define PTD6_EMAC_MII_TXD3              NXP_SIUL2_PINMUX(0, 0, 102, 1, 0, 0)
#define PTD7_EMAC_MII_RMII_TXD0         NXP_SIUL2_PINMUX(0, 0, 103, 1, 0, 0)
#define PTD7_EMAC_MII_RMII_TXD1         NXP_SIUL2_PINMUX(0, 0, 103, 5, 0, 0)
#define PTD7_QUADSPI_IOFA1_I            NXP_SIUL2_PINMUX(0, 0, 103, 0, 306, 1)
#define PTD7_QUADSPI_IOFA1_O            NXP_SIUL2_PINMUX(0, 0, 103, 7, 0, 0)
#define PTD7_TRACE_ETM_D0               NXP_SIUL2_PINMUX(0, 0, 103, 6, 0, 0)
#define PTD8_EMAC_MII_RMII_RXD1         NXP_SIUL2_PINMUX(0, 0, 104, 0, 295, 3)
#define PTD8_EMAC_MII_RXD3              NXP_SIUL2_PINMUX(0, 0, 104, 0, 302, 1)
#define PTD9_EMAC_MII_RMII_RXD0         NXP_SIUL2_PINMUX(0, 0, 105, 0, 294, 3)
#define PTD9_EMAC_MII_RXD2              NXP_SIUL2_PINMUX(0, 0, 105, 0, 301, 1)
#define PTE12_EMAC_PPS3_I               NXP_SIUL2_PINMUX(0, 0, 140, 0, 147, 3)
#define PTE12_EMAC_PPS3_O               NXP_SIUL2_PINMUX(0, 0, 140, 5, 0, 0)
#define PTE14_EMAC_PPS1_I               NXP_SIUL2_PINMUX(0, 0, 142, 0, 145, 1)
#define PTE14_EMAC_PPS1_O               NXP_SIUL2_PINMUX(0, 0, 142, 7, 0, 0)
#define PTE17_EMIOS_2_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 145, 0, 135, 4)
#define PTE17_EMIOS_2_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 145, 4, 0, 0)
#define PTE18_EMIOS_2_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 146, 0, 129, 4)
#define PTE18_EMIOS_2_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 146, 4, 0, 0)
#define PTE20_EMIOS_1_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 148, 0, 80, 2)
#define PTE20_EMIOS_1_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 148, 2, 0, 0)
#define PTE21_EMIOS_2_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 149, 0, 131, 4)
#define PTE21_EMIOS_2_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 149, 4, 0, 0)
#define PTE21_LPSPI4_SIN_I              NXP_SIUL2_PINMUX(0, 0, 149, 0, 260, 3)
#define PTE21_LPSPI4_SIN_O              NXP_SIUL2_PINMUX(0, 0, 149, 6, 0, 0)
#define PTE22_EMIOS_2_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 150, 0, 132, 4)
#define PTE22_EMIOS_2_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 150, 4, 0, 0)
#define PTE22_LPSPI4_SCK_I              NXP_SIUL2_PINMUX(0, 0, 150, 0, 259, 3)
#define PTE22_LPSPI4_SCK_O              NXP_SIUL2_PINMUX(0, 0, 150, 6, 0, 0)
#define PTE23_EMIOS_2_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 151, 0, 133, 4)
#define PTE23_EMIOS_2_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 151, 4, 0, 0)
#define PTE23_LPSPI4_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 151, 0, 255, 4)
#define PTE23_LPSPI4_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 151, 6, 0, 0)
#define PTE24_EMIOS_2_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 152, 0, 116, 3)
#define PTE24_EMIOS_2_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 152, 4, 0, 0)
#define PTE24_LPSPI4_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 152, 0, 256, 3)
#define PTE24_LPSPI4_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 152, 6, 0, 0)
#define PTE25_EMIOS_2_CH5_H_I           NXP_SIUL2_PINMUX(0, 0, 153, 0, 117, 2)
#define PTE25_EMIOS_2_CH5_H_O           NXP_SIUL2_PINMUX(0, 0, 153, 4, 0, 0)
#define PTE25_LPSPI4_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 153, 0, 261, 3)
#define PTE25_LPSPI4_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 153, 6, 0, 0)
#define PTE26_EMIOS_2_CH6_H_I           NXP_SIUL2_PINMUX(0, 0, 154, 0, 118, 3)
#define PTE26_EMIOS_2_CH6_H_O           NXP_SIUL2_PINMUX(0, 0, 154, 4, 0, 0)
#define PTE27_EMIOS_1_CH7_H_I           NXP_SIUL2_PINMUX(0, 0, 155, 0, 87, 1)
#define PTE27_EMIOS_1_CH7_H_O           NXP_SIUL2_PINMUX(0, 0, 155, 2, 0, 0)
#define PTE28_CAN3_TX                   NXP_SIUL2_PINMUX(0, 0, 156, 1, 0, 0)
#define PTE29_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 157, 0, 3, 4)
#define PTE2_LPUART10_RX                NXP_SIUL2_PINMUX(0, 0, 130, 0, 197, 1)
#define PTE30_CAN4_TX                   NXP_SIUL2_PINMUX(0, 0, 158, 1, 0, 0)
#define PTE30_CMP1_OUT                  NXP_SIUL2_PINMUX(0, 0, 158, 2, 0, 0)
#define PTE31_CAN4_RX                   NXP_SIUL2_PINMUX(0, 0, 159, 0, 4, 4)
#define PTE31_CMP1_RR_ACTIVES           NXP_SIUL2_PINMUX(0, 0, 159, 2, 0, 0)
#define PTE3_EMAC_PPS0_I                NXP_SIUL2_PINMUX(0, 0, 131, 0, 144, 1)
#define PTE3_EMAC_PPS0_O                NXP_SIUL2_PINMUX(0, 0, 131, 6, 0, 0)
#define PTE4_LPUART12_TX_I              NXP_SIUL2_PINMUX(0, 0, 132, 0, 375, 2)
#define PTE4_LPUART12_TX_O              NXP_SIUL2_PINMUX(0, 0, 132, 5, 0, 0)
#define PTE5_LPUART12_RX                NXP_SIUL2_PINMUX(0, 0, 133, 0, 199, 1)
#define PTE6_LPUART10_TX_I              NXP_SIUL2_PINMUX(0, 0, 134, 0, 373, 2)
#define PTE6_LPUART10_TX_O              NXP_SIUL2_PINMUX(0, 0, 134, 5, 0, 0)
#define PTE8_EMAC_MII_RMII_MDC          NXP_SIUL2_PINMUX(0, 0, 136, 5, 0, 0)
#define PTE8_LPSPI5_PCS1_I              NXP_SIUL2_PINMUX(0, 0, 136, 0, 263, 1)
#define PTE8_LPSPI5_PCS1_O              NXP_SIUL2_PINMUX(0, 0, 136, 3, 0, 0)
#define PTE8_SAI1_BCLK_I                NXP_SIUL2_PINMUX(0, 0, 136, 0, 322, 1)
#define PTE8_SAI1_BCLK_O                NXP_SIUL2_PINMUX(0, 0, 136, 6, 0, 0)
#define PTE9_EMAC_MII_RMII_TX_EN        NXP_SIUL2_PINMUX(0, 0, 137, 6, 0, 0)
#define PTE9_EMAC_PPS3_I                NXP_SIUL2_PINMUX(0, 0, 137, 0, 147, 1)
#define PTE9_EMAC_PPS3_O                NXP_SIUL2_PINMUX(0, 0, 137, 5, 0, 0)
#define PTE9_LPSPI5_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 137, 0, 268, 1)
#define PTE9_LPSPI5_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 137, 1, 0, 0)
#define PTF0_EIRQ0                      NXP_SIUL2_PINMUX(0, 0, 160, 0, 16, 5)
#define PTF0_EMIOS_2_CH0_X_I            NXP_SIUL2_PINMUX(0, 0, 160, 0, 112, 1)
#define PTF0_EMIOS_2_CH0_X_O            NXP_SIUL2_PINMUX(0, 0, 160, 2, 0, 0)
#define PTF0_LPSPI2_SCK_I               NXP_SIUL2_PINMUX(0, 0, 160, 0, 245, 4)
#define PTF0_LPSPI2_SCK_O               NXP_SIUL2_PINMUX(0, 0, 160, 3, 0, 0)
#define PTF0_LPUART5_TX_I               NXP_SIUL2_PINMUX(0, 0, 160, 0, 368, 4)
#define PTF0_LPUART5_TX_O               NXP_SIUL2_PINMUX(0, 0, 160, 1, 0, 0)
#define PTF10_ADC0_MA1                  NXP_SIUL2_PINMUX(0, 0, 170, 3, 0, 0)
#define PTF10_EIRQ18                    NXP_SIUL2_PINMUX(0, 0, 170, 0, 34, 4)
#define PTF10_EMIOS_2_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 170, 0, 122, 1)
#define PTF10_EMIOS_2_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 170, 2, 0, 0)
#define PTF11_ADC0_MA2                  NXP_SIUL2_PINMUX(0, 0, 171, 3, 0, 0)
#define PTF11_EIRQ19                    NXP_SIUL2_PINMUX(0, 0, 171, 0, 35, 4)
#define PTF11_EMIOS_2_CH11_H_I          NXP_SIUL2_PINMUX(0, 0, 171, 0, 123, 1)
#define PTF11_EMIOS_2_CH11_H_O          NXP_SIUL2_PINMUX(0, 0, 171, 2, 0, 0)
#define PTF11_HSE_TAMPER_EXTIN0         NXP_SIUL2_PINMUX(0, 0, 171, 0, 343, 4)
#define PTF12_ADC0_MA0                  NXP_SIUL2_PINMUX(0, 0, 172, 3, 0, 0)
#define PTF12_EIRQ20                    NXP_SIUL2_PINMUX(0, 0, 172, 0, 36, 4)
#define PTF12_EMIOS_2_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 172, 0, 124, 2)
#define PTF12_EMIOS_2_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 172, 2, 0, 0)
#define PTF12_LPSPI3_SIN_I              NXP_SIUL2_PINMUX(0, 0, 172, 0, 253, 4)
#define PTF12_LPSPI3_SIN_O              NXP_SIUL2_PINMUX(0, 0, 172, 4, 0, 0)
#define PTF12_LPUART10_TX_I             NXP_SIUL2_PINMUX(0, 0, 172, 0, 373, 3)
#define PTF12_LPUART10_TX_O             NXP_SIUL2_PINMUX(0, 0, 172, 1, 0, 0)
#define PTF13_ADC0_MA1                  NXP_SIUL2_PINMUX(0, 0, 173, 3, 0, 0)
#define PTF13_EIRQ21                    NXP_SIUL2_PINMUX(0, 0, 173, 0, 37, 4)
#define PTF13_EMIOS_2_CH13_H_I          NXP_SIUL2_PINMUX(0, 0, 173, 0, 125, 1)
#define PTF13_EMIOS_2_CH13_H_O          NXP_SIUL2_PINMUX(0, 0, 173, 2, 0, 0)
#define PTF13_LPSPI3_SCK_I              NXP_SIUL2_PINMUX(0, 0, 173, 0, 252, 4)
#define PTF13_LPSPI3_SCK_O              NXP_SIUL2_PINMUX(0, 0, 173, 4, 0, 0)
#define PTF13_LPUART10_RX               NXP_SIUL2_PINMUX(0, 0, 173, 0, 197, 3)
#define PTF14_CAN1_TX                   NXP_SIUL2_PINMUX(0, 0, 174, 1, 0, 0)
#define PTF14_CMP0_OUT                  NXP_SIUL2_PINMUX(0, 0, 174, 3, 0, 0)
#define PTF14_EIRQ22                    NXP_SIUL2_PINMUX(0, 0, 174, 0, 38, 4)
#define PTF14_EMIOS_2_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 174, 0, 126, 1)
#define PTF14_EMIOS_2_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 174, 2, 0, 0)
#define PTF14_FCCU_ERR0                 NXP_SIUL2_PINMUX(0, 0, 174, 4, 0, 0)
#define PTF14_FCCU_ERR_IN0              NXP_SIUL2_PINMUX(0, 0, 174, 0, 148, 3)
#define PTF14_FXIO_D3_I                 NXP_SIUL2_PINMUX(0, 0, 174, 0, 155, 8)
#define PTF14_FXIO_D3_O                 NXP_SIUL2_PINMUX(0, 0, 174, 5, 0, 0)
#define PTF15_CAN1_RX                   NXP_SIUL2_PINMUX(0, 0, 175, 0, 1, 5)
#define PTF15_CMP0_RR_ACTIVE            NXP_SIUL2_PINMUX(0, 0, 175, 3, 0, 0)
#define PTF15_EIRQ23                    NXP_SIUL2_PINMUX(0, 0, 175, 0, 39, 4)
#define PTF15_EMIOS_2_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 175, 0, 127, 1)
#define PTF15_EMIOS_2_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 175, 2, 0, 0)
#define PTF15_FCCU_ERR1                 NXP_SIUL2_PINMUX(0, 0, 175, 5, 0, 0)
#define PTF15_FCCU_ERR_IN1              NXP_SIUL2_PINMUX(0, 0, 175, 0, 149, 3)
#define PTF15_LPSPI3_SOUT_I             NXP_SIUL2_PINMUX(0, 0, 175, 0, 254, 4)
#define PTF15_LPSPI3_SOUT_O             NXP_SIUL2_PINMUX(0, 0, 175, 4, 0, 0)
#define PTF16_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 176, 4, 0, 0)
#define PTF16_EMIOS_1_CH0_X_I           NXP_SIUL2_PINMUX(0, 0, 176, 0, 80, 5)
#define PTF16_EMIOS_1_CH0_X_O           NXP_SIUL2_PINMUX(0, 0, 176, 3, 0, 0)
#define PTF16_EMIOS_2_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 176, 0, 128, 4)
#define PTF16_EMIOS_2_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 176, 2, 0, 0)
#define PTF16_LPSPI3_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 176, 0, 248, 4)
#define PTF16_LPSPI3_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 176, 5, 0, 0)
#define PTF16_LPUART12_TX_I             NXP_SIUL2_PINMUX(0, 0, 176, 0, 375, 3)
#define PTF16_LPUART12_TX_O             NXP_SIUL2_PINMUX(0, 0, 176, 1, 0, 0)
#define PTF17_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 177, 4, 0, 0)
#define PTF17_EMIOS_1_CH1_H_I           NXP_SIUL2_PINMUX(0, 0, 177, 0, 81, 5)
#define PTF17_EMIOS_1_CH1_H_O           NXP_SIUL2_PINMUX(0, 0, 177, 3, 0, 0)
#define PTF17_EMIOS_2_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 177, 0, 129, 3)
#define PTF17_EMIOS_2_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 177, 2, 0, 0)
#define PTF17_LPUART12_RX               NXP_SIUL2_PINMUX(0, 0, 177, 0, 199, 3)
#define PTF18_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 178, 4, 0, 0)
#define PTF18_EMIOS_1_CH2_H_I           NXP_SIUL2_PINMUX(0, 0, 178, 0, 82, 5)
#define PTF18_EMIOS_1_CH2_H_O           NXP_SIUL2_PINMUX(0, 0, 178, 3, 0, 0)
#define PTF18_EMIOS_2_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 178, 0, 130, 3)
#define PTF18_EMIOS_2_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 178, 2, 0, 0)
#define PTF18_LPSPI3_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 178, 0, 249, 2)
#define PTF18_LPSPI3_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 178, 5, 0, 0)
#define PTF18_LPUART7_TX_I              NXP_SIUL2_PINMUX(0, 0, 178, 0, 370, 4)
#define PTF18_LPUART7_TX_O              NXP_SIUL2_PINMUX(0, 0, 178, 1, 0, 0)
#define PTF19_ADC0_MA2                  NXP_SIUL2_PINMUX(0, 0, 179, 4, 0, 0)
#define PTF19_EMIOS_1_CH3_H_I           NXP_SIUL2_PINMUX(0, 0, 179, 0, 83, 5)
#define PTF19_EMIOS_1_CH3_H_O           NXP_SIUL2_PINMUX(0, 0, 179, 3, 0, 0)
#define PTF19_EMIOS_2_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 179, 0, 131, 3)
#define PTF19_EMIOS_2_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 179, 2, 0, 0)
#define PTF19_HSE_TAMPER_LOOP_OUT0      NXP_SIUL2_PINMUX(0, 0, 179, 6, 0, 0)
#define PTF19_LPSPI3_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 179, 0, 250, 2)
#define PTF19_LPSPI3_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 179, 5, 0, 0)
#define PTF19_LPUART7_RX                NXP_SIUL2_PINMUX(0, 0, 179, 0, 194, 3)
#define PTF1_EIRQ1                      NXP_SIUL2_PINMUX(0, 0, 161, 0, 17, 5)
#define PTF1_EMIOS_2_CH1_H_I            NXP_SIUL2_PINMUX(0, 0, 161, 0, 113, 1)
#define PTF1_EMIOS_2_CH1_H_O            NXP_SIUL2_PINMUX(0, 0, 161, 2, 0, 0)
#define PTF1_LPSPI2_SIN_I               NXP_SIUL2_PINMUX(0, 0, 161, 0, 246, 4)
#define PTF1_LPSPI2_SIN_O               NXP_SIUL2_PINMUX(0, 0, 161, 3, 0, 0)
#define PTF1_LPUART5_RX                 NXP_SIUL2_PINMUX(0, 0, 161, 0, 192, 3)
#define PTF20_CAN0_TX                   NXP_SIUL2_PINMUX(0, 0, 180, 6, 0, 0)
#define PTF20_EMIOS_1_CH4_H_I           NXP_SIUL2_PINMUX(0, 0, 180, 0, 84, 5)
#define PTF20_EMIOS_1_CH4_H_O           NXP_SIUL2_PINMUX(0, 0, 180, 3, 0, 0)
#define PTF20_EMIOS_2_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 180, 0, 132, 3)
#define PTF20_EMIOS_2_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 180, 2, 0, 0)
#define PTF20_FXIO_D4_I                 NXP_SIUL2_PINMUX(0, 0, 180, 0, 156, 8)
#define PTF20_FXIO_D4_O                 NXP_SIUL2_PINMUX(0, 0, 180, 7, 0, 0)
#define PTF20_LPI2C0_SCL_I              NXP_SIUL2_PINMUX(0, 0, 180, 0, 212, 3)
#define PTF20_LPI2C0_SCL_O              NXP_SIUL2_PINMUX(0, 0, 180, 4, 0, 0)
#define PTF20_LPSPI3_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 180, 0, 251, 2)
#define PTF20_LPSPI3_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 180, 5, 0, 0)
#define PTF20_LPUART8_TX_I              NXP_SIUL2_PINMUX(0, 0, 180, 0, 371, 3)
#define PTF20_LPUART8_TX_O              NXP_SIUL2_PINMUX(0, 0, 180, 1, 0, 0)
#define PTF21_CAN0_RX                   NXP_SIUL2_PINMUX(0, 0, 181, 0, 0, 5)
#define PTF21_EMIOS_1_CH5_H_I           NXP_SIUL2_PINMUX(0, 0, 181, 0, 85, 6)
#define PTF21_EMIOS_1_CH5_H_O           NXP_SIUL2_PINMUX(0, 0, 181, 3, 0, 0)
#define PTF21_EMIOS_2_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 181, 0, 133, 3)
#define PTF21_EMIOS_2_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 181, 2, 0, 0)
#define PTF21_FXIO_D5_I                 NXP_SIUL2_PINMUX(0, 0, 181, 0, 157, 11)
#define PTF21_FXIO_D5_O                 NXP_SIUL2_PINMUX(0, 0, 181, 7, 0, 0)
#define PTF21_LPI2C0_SDA_I              NXP_SIUL2_PINMUX(0, 0, 181, 0, 214, 3)
#define PTF21_LPI2C0_SDA_O              NXP_SIUL2_PINMUX(0, 0, 181, 4, 0, 0)
#define PTF21_LPSPI1_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 181, 0, 232, 4)
#define PTF21_LPSPI1_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 181, 5, 0, 0)
#define PTF21_LPUART8_RX                NXP_SIUL2_PINMUX(0, 0, 181, 0, 195, 3)
#define PTF22_EMIOS_1_CH6_H_I           NXP_SIUL2_PINMUX(0, 0, 182, 0, 86, 5)
#define PTF22_EMIOS_1_CH6_H_O           NXP_SIUL2_PINMUX(0, 0, 182, 3, 0, 0)
#define PTF22_EMIOS_2_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 182, 0, 134, 5)
#define PTF22_EMIOS_2_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 182, 2, 0, 0)
#define PTF22_LPSPI4_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 182, 0, 257, 2)
#define PTF22_LPSPI4_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 182, 6, 0, 0)
#define PTF23_EMIOS_1_CH7_H_I           NXP_SIUL2_PINMUX(0, 0, 183, 0, 87, 5)
#define PTF23_EMIOS_1_CH7_H_O           NXP_SIUL2_PINMUX(0, 0, 183, 3, 0, 0)
#define PTF23_EMIOS_2_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 183, 0, 135, 5)
#define PTF23_EMIOS_2_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 183, 2, 0, 0)
#define PTF23_LPSPI3_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 183, 0, 251, 3)
#define PTF23_LPSPI3_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 183, 5, 0, 0)
#define PTF23_LPUART9_TX_I              NXP_SIUL2_PINMUX(0, 0, 183, 0, 372, 3)
#define PTF23_LPUART9_TX_O              NXP_SIUL2_PINMUX(0, 0, 183, 1, 0, 0)
#define PTF24_EMIOS_1_CH8_X_I           NXP_SIUL2_PINMUX(0, 0, 184, 0, 88, 3)
#define PTF24_EMIOS_1_CH8_X_O           NXP_SIUL2_PINMUX(0, 0, 184, 3, 0, 0)
#define PTF24_LPUART9_RX                NXP_SIUL2_PINMUX(0, 0, 184, 0, 196, 3)
#define PTF25_CAN2_TX                   NXP_SIUL2_PINMUX(0, 0, 185, 1, 0, 0)
#define PTF25_EMIOS_1_CH9_H_I           NXP_SIUL2_PINMUX(0, 0, 185, 0, 89, 3)
#define PTF25_EMIOS_1_CH9_H_O           NXP_SIUL2_PINMUX(0, 0, 185, 3, 0, 0)
#define PTF25_FXIO_D6_I                 NXP_SIUL2_PINMUX(0, 0, 185, 0, 158, 10)
#define PTF25_FXIO_D6_O                 NXP_SIUL2_PINMUX(0, 0, 185, 7, 0, 0)
#define PTF25_LPSPI2_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 185, 0, 243, 3)
#define PTF25_LPSPI2_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 185, 5, 0, 0)
#define PTF25_LPSPI4_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 185, 0, 255, 3)
#define PTF25_LPSPI4_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 185, 6, 0, 0)
#define PTF26_CAN2_RX                   NXP_SIUL2_PINMUX(0, 0, 186, 0, 2, 5)
#define PTF26_EMIOS_1_CH10_H_I          NXP_SIUL2_PINMUX(0, 0, 186, 0, 90, 4)
#define PTF26_EMIOS_1_CH10_H_O          NXP_SIUL2_PINMUX(0, 0, 186, 3, 0, 0)
#define PTF26_LPSPI2_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 186, 0, 244, 2)
#define PTF26_LPSPI2_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 186, 5, 0, 0)
#define PTF26_LPSPI4_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 186, 0, 256, 2)
#define PTF26_LPSPI4_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 186, 6, 0, 0)
#define PTF27_EMIOS_1_CH11_H_I          NXP_SIUL2_PINMUX(0, 0, 187, 0, 91, 3)
#define PTF27_EMIOS_1_CH11_H_O          NXP_SIUL2_PINMUX(0, 0, 187, 3, 0, 0)
#define PTF27_LPSPI4_PCS2_I             NXP_SIUL2_PINMUX(0, 0, 187, 0, 257, 3)
#define PTF27_LPSPI4_PCS2_O             NXP_SIUL2_PINMUX(0, 0, 187, 6, 0, 0)
#define PTF27_LPUART11_TX_I             NXP_SIUL2_PINMUX(0, 0, 187, 0, 374, 3)
#define PTF27_LPUART11_TX_O             NXP_SIUL2_PINMUX(0, 0, 187, 1, 0, 0)
#define PTF28_EMIOS_1_CH12_H_I          NXP_SIUL2_PINMUX(0, 0, 188, 0, 92, 4)
#define PTF28_EMIOS_1_CH12_H_O          NXP_SIUL2_PINMUX(0, 0, 188, 3, 0, 0)
#define PTF28_FXIO_D7_I                 NXP_SIUL2_PINMUX(0, 0, 188, 0, 159, 8)
#define PTF28_FXIO_D7_O                 NXP_SIUL2_PINMUX(0, 0, 188, 4, 0, 0)
#define PTF28_LPSPI0_PCS0_I             NXP_SIUL2_PINMUX(0, 0, 188, 0, 221, 4)
#define PTF28_LPSPI0_PCS0_O             NXP_SIUL2_PINMUX(0, 0, 188, 5, 0, 0)
#define PTF28_LPSPI4_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 188, 0, 258, 2)
#define PTF28_LPSPI4_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 188, 6, 0, 0)
#define PTF28_LPUART11_RX               NXP_SIUL2_PINMUX(0, 0, 188, 0, 198, 3)
#define PTF28_TRACE_ETM_D5              NXP_SIUL2_PINMUX(0, 0, 188, 7, 0, 0)
#define PTF29_ADC1_MA0                  NXP_SIUL2_PINMUX(0, 0, 189, 4, 0, 0)
#define PTF29_CAN3_TX                   NXP_SIUL2_PINMUX(0, 0, 189, 1, 0, 0)
#define PTF29_EMIOS_1_CH13_H_I          NXP_SIUL2_PINMUX(0, 0, 189, 0, 93, 3)
#define PTF29_EMIOS_1_CH13_H_O          NXP_SIUL2_PINMUX(0, 0, 189, 3, 0, 0)
#define PTF29_FXIO_D8_I                 NXP_SIUL2_PINMUX(0, 0, 189, 0, 160, 6)
#define PTF29_FXIO_D8_O                 NXP_SIUL2_PINMUX(0, 0, 189, 7, 0, 0)
#define PTF29_LPSPI3_PCS1_I             NXP_SIUL2_PINMUX(0, 0, 189, 0, 249, 3)
#define PTF29_LPSPI3_PCS1_O             NXP_SIUL2_PINMUX(0, 0, 189, 5, 0, 0)
#define PTF2_EIRQ2                      NXP_SIUL2_PINMUX(0, 0, 162, 0, 18, 5)
#define PTF2_EMIOS_2_CH2_H_I            NXP_SIUL2_PINMUX(0, 0, 162, 0, 114, 1)
#define PTF2_EMIOS_2_CH2_H_O            NXP_SIUL2_PINMUX(0, 0, 162, 2, 0, 0)
#define PTF2_LPSPI2_SOUT_I              NXP_SIUL2_PINMUX(0, 0, 162, 0, 247, 4)
#define PTF2_LPSPI2_SOUT_O              NXP_SIUL2_PINMUX(0, 0, 162, 3, 0, 0)
#define PTF2_LPUART6_TX_I               NXP_SIUL2_PINMUX(0, 0, 162, 0, 369, 4)
#define PTF2_LPUART6_TX_O               NXP_SIUL2_PINMUX(0, 0, 162, 1, 0, 0)
#define PTF30_ADC1_MA1                  NXP_SIUL2_PINMUX(0, 0, 190, 4, 0, 0)
#define PTF30_CAN3_RX                   NXP_SIUL2_PINMUX(0, 0, 190, 0, 3, 5)
#define PTF30_EMIOS_1_CH14_H_I          NXP_SIUL2_PINMUX(0, 0, 190, 0, 94, 3)
#define PTF30_EMIOS_1_CH14_H_O          NXP_SIUL2_PINMUX(0, 0, 190, 3, 0, 0)
#define PTF31_ADC1_MA2                  NXP_SIUL2_PINMUX(0, 0, 191, 1, 0, 0)
#define PTF31_EMIOS_1_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 191, 0, 95, 4)
#define PTF31_EMIOS_1_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 191, 3, 0, 0)
#define PTF31_FXIO_D9_I                 NXP_SIUL2_PINMUX(0, 0, 191, 0, 161, 5)
#define PTF31_FXIO_D9_O                 NXP_SIUL2_PINMUX(0, 0, 191, 6, 0, 0)
#define PTF31_TRACE_ETM_D3              NXP_SIUL2_PINMUX(0, 0, 191, 7, 0, 0)
#define PTF3_EIRQ3                      NXP_SIUL2_PINMUX(0, 0, 163, 0, 19, 5)
#define PTF3_EMIOS_2_CH3_H_I            NXP_SIUL2_PINMUX(0, 0, 163, 0, 115, 1)
#define PTF3_EMIOS_2_CH3_H_O            NXP_SIUL2_PINMUX(0, 0, 163, 2, 0, 0)
#define PTF3_LPSPI2_PCS0_I              NXP_SIUL2_PINMUX(0, 0, 163, 0, 241, 6)
#define PTF3_LPSPI2_PCS0_O              NXP_SIUL2_PINMUX(0, 0, 163, 3, 0, 0)
#define PTF3_LPUART6_RX                 NXP_SIUL2_PINMUX(0, 0, 163, 0, 193, 3)
#define PTF4_CAN5_TX                    NXP_SIUL2_PINMUX(0, 0, 164, 1, 0, 0)
#define PTF4_EIRQ4                      NXP_SIUL2_PINMUX(0, 0, 164, 0, 20, 5)
#define PTF4_EMIOS_2_CH4_H_I            NXP_SIUL2_PINMUX(0, 0, 164, 0, 116, 1)
#define PTF4_EMIOS_2_CH4_H_O            NXP_SIUL2_PINMUX(0, 0, 164, 2, 0, 0)
#define PTF4_FXIO_D0_I                  NXP_SIUL2_PINMUX(0, 0, 164, 0, 152, 7)
#define PTF4_FXIO_D0_O                  NXP_SIUL2_PINMUX(0, 0, 164, 4, 0, 0)
#define PTF5_CAN5_RX                    NXP_SIUL2_PINMUX(0, 0, 165, 0, 5, 3)
#define PTF5_EIRQ5                      NXP_SIUL2_PINMUX(0, 0, 165, 0, 21, 5)
#define PTF5_EMIOS_2_CH5_H_I            NXP_SIUL2_PINMUX(0, 0, 165, 0, 117, 1)
#define PTF5_EMIOS_2_CH5_H_O            NXP_SIUL2_PINMUX(0, 0, 165, 2, 0, 0)
#define PTF6_EIRQ6                      NXP_SIUL2_PINMUX(0, 0, 166, 0, 22, 5)
#define PTF6_EMIOS_2_CH6_H_I            NXP_SIUL2_PINMUX(0, 0, 166, 0, 118, 1)
#define PTF6_EMIOS_2_CH6_H_O            NXP_SIUL2_PINMUX(0, 0, 166, 2, 0, 0)
#define PTF7_EIRQ7                      NXP_SIUL2_PINMUX(0, 0, 167, 0, 23, 5)
#define PTF7_EMIOS_2_CH7_H_I            NXP_SIUL2_PINMUX(0, 0, 167, 0, 119, 2)
#define PTF7_EMIOS_2_CH7_H_O            NXP_SIUL2_PINMUX(0, 0, 167, 2, 0, 0)
#define PTF7_FXIO_D1_I                  NXP_SIUL2_PINMUX(0, 0, 167, 0, 153, 8)
#define PTF7_FXIO_D1_O                  NXP_SIUL2_PINMUX(0, 0, 167, 4, 0, 0)
#define PTF7_LPI2C1_SCL_I               NXP_SIUL2_PINMUX(0, 0, 167, 0, 217, 5)
#define PTF7_LPI2C1_SCL_O               NXP_SIUL2_PINMUX(0, 0, 167, 3, 0, 0)
#define PTF8_EIRQ16                     NXP_SIUL2_PINMUX(0, 0, 168, 0, 32, 4)
#define PTF8_EMIOS_2_CH8_X_I            NXP_SIUL2_PINMUX(0, 0, 168, 0, 120, 1)
#define PTF8_EMIOS_2_CH8_X_O            NXP_SIUL2_PINMUX(0, 0, 168, 2, 0, 0)
#define PTF8_FXIO_D2_I                  NXP_SIUL2_PINMUX(0, 0, 168, 0, 154, 9)
#define PTF8_FXIO_D2_O                  NXP_SIUL2_PINMUX(0, 0, 168, 4, 0, 0)
#define PTF8_LPI2C1_SDA_I               NXP_SIUL2_PINMUX(0, 0, 168, 0, 219, 4)
#define PTF8_LPI2C1_SDA_O               NXP_SIUL2_PINMUX(0, 0, 168, 3, 0, 0)
#define PTF9_ADC0_MA0                   NXP_SIUL2_PINMUX(0, 0, 169, 3, 0, 0)
#define PTF9_EIRQ17                     NXP_SIUL2_PINMUX(0, 0, 169, 0, 33, 4)
#define PTF9_EMIOS_2_CH9_H_I            NXP_SIUL2_PINMUX(0, 0, 169, 0, 121, 1)
#define PTF9_EMIOS_2_CH9_H_O            NXP_SIUL2_PINMUX(0, 0, 169, 2, 0, 0)
#define PTG0_EIRQ8                      NXP_SIUL2_PINMUX(0, 0, 192, 0, 24, 5)
#define PTG0_EMIOS_1_CH16_X_I           NXP_SIUL2_PINMUX(0, 0, 192, 0, 96, 4)
#define PTG0_EMIOS_1_CH16_X_O           NXP_SIUL2_PINMUX(0, 0, 192, 3, 0, 0)
#define PTG0_LPUART13_TX_I              NXP_SIUL2_PINMUX(0, 0, 192, 0, 376, 3)
