zephyrproject-rtos/hal_nxp/dts/nxp/mcx/mcxe/pinctrl/MCXE31BMPB-pinctrl.h
#define PTG0_LPUART13_TX_O              NXP_SIUL2_PINMUX(0, 0, 192, 1, 0, 0)
#define PTG10_EIRQ26                    NXP_SIUL2_PINMUX(0, 0, 202, 0, 42, 4)
#define PTG11_EIRQ27                    NXP_SIUL2_PINMUX(0, 0, 203, 0, 43, 4)
#define PTG12_EIRQ28                    NXP_SIUL2_PINMUX(0, 0, 204, 0, 44, 4)
#define PTG12_LPSPI4_PCS3_I             NXP_SIUL2_PINMUX(0, 0, 204, 0, 258, 3)
#define PTG12_LPSPI4_PCS3_O             NXP_SIUL2_PINMUX(0, 0, 204, 6, 0, 0)
#define PTG13_CAN5_TX                   NXP_SIUL2_PINMUX(0, 0, 205, 1, 0, 0)
#define PTG13_EIRQ29                    NXP_SIUL2_PINMUX(0, 0, 205, 0, 45, 4)
#define PTG13_FXIO_D13_I                NXP_SIUL2_PINMUX(0, 0, 205, 0, 165, 5)
#define PTG13_FXIO_D13_O                NXP_SIUL2_PINMUX(0, 0, 205, 2, 0, 0)
#define PTG14_CAN5_RX                   NXP_SIUL2_PINMUX(0, 0, 206, 0, 5, 4)
#define PTG14_EIRQ30                    NXP_SIUL2_PINMUX(0, 0, 206, 0, 46, 4)
#define PTG15_EIRQ31                    NXP_SIUL2_PINMUX(0, 0, 207, 0, 47, 4)
#define PTG15_EMIOS_2_CH15_H_I          NXP_SIUL2_PINMUX(0, 0, 207, 0, 127, 4)
#define PTG15_EMIOS_2_CH15_H_O          NXP_SIUL2_PINMUX(0, 0, 207, 5, 0, 0)
#define PTG15_FXIO_D14_I                NXP_SIUL2_PINMUX(0, 0, 207, 0, 166, 5)
#define PTG15_FXIO_D14_O                NXP_SIUL2_PINMUX(0, 0, 207, 2, 0, 0)
#define PTG15_TRACE_ETM_D1              NXP_SIUL2_PINMUX(0, 0, 207, 7, 0, 0)
#define PTG16_EMIOS_2_CH16_X_I          NXP_SIUL2_PINMUX(0, 0, 208, 0, 128, 1)
#define PTG16_EMIOS_2_CH16_X_O          NXP_SIUL2_PINMUX(0, 0, 208, 2, 0, 0)
#define PTG16_FXIO_D15_I                NXP_SIUL2_PINMUX(0, 0, 208, 0, 167, 6)
#define PTG16_FXIO_D15_O                NXP_SIUL2_PINMUX(0, 0, 208, 3, 0, 0)
#define PTG16_TRACE_ETM_D2              NXP_SIUL2_PINMUX(0, 0, 208, 7, 0, 0)
#define PTG17_EMIOS_2_CH17_Y_I          NXP_SIUL2_PINMUX(0, 0, 209, 0, 129, 1)
#define PTG17_EMIOS_2_CH17_Y_O          NXP_SIUL2_PINMUX(0, 0, 209, 2, 0, 0)
#define PTG17_FXIO_D16_I                NXP_SIUL2_PINMUX(0, 0, 209, 0, 168, 4)
#define PTG17_FXIO_D16_O                NXP_SIUL2_PINMUX(0, 0, 209, 3, 0, 0)
#define PTG17_TRACE_ETM_D4              NXP_SIUL2_PINMUX(0, 0, 209, 7, 0, 0)
#define PTG18_EMIOS_2_CH18_Y_I          NXP_SIUL2_PINMUX(0, 0, 210, 0, 130, 1)
#define PTG18_EMIOS_2_CH18_Y_O          NXP_SIUL2_PINMUX(0, 0, 210, 2, 0, 0)
#define PTG18_FXIO_D17_I                NXP_SIUL2_PINMUX(0, 0, 210, 0, 169, 3)
#define PTG18_FXIO_D17_O                NXP_SIUL2_PINMUX(0, 0, 210, 3, 0, 0)
#define PTG18_TRACE_ETM_D6              NXP_SIUL2_PINMUX(0, 0, 210, 7, 0, 0)
#define PTG19_EMIOS_2_CH19_Y_I          NXP_SIUL2_PINMUX(0, 0, 211, 0, 131, 1)
#define PTG19_EMIOS_2_CH19_Y_O          NXP_SIUL2_PINMUX(0, 0, 211, 2, 0, 0)
#define PTG19_FXIO_D18_I                NXP_SIUL2_PINMUX(0, 0, 211, 0, 170, 3)
#define PTG19_FXIO_D18_O                NXP_SIUL2_PINMUX(0, 0, 211, 3, 0, 0)
#define PTG19_TRACE_ETM_D7              NXP_SIUL2_PINMUX(0, 0, 211, 7, 0, 0)
#define PTG1_EIRQ9                      NXP_SIUL2_PINMUX(0, 0, 193, 0, 25, 5)
#define PTG1_EMIOS_1_CH17_Y_I           NXP_SIUL2_PINMUX(0, 0, 193, 0, 97, 3)
#define PTG1_EMIOS_1_CH17_Y_O           NXP_SIUL2_PINMUX(0, 0, 193, 3, 0, 0)
#define PTG1_LPUART13_RX                NXP_SIUL2_PINMUX(0, 0, 193, 0, 200, 3)
#define PTG20_EMIOS_2_CH20_Y_I          NXP_SIUL2_PINMUX(0, 0, 212, 0, 132, 1)
#define PTG20_EMIOS_2_CH20_Y_O          NXP_SIUL2_PINMUX(0, 0, 212, 2, 0, 0)
#define PTG20_FXIO_D19_I                NXP_SIUL2_PINMUX(0, 0, 212, 0, 171, 6)
#define PTG20_FXIO_D19_O                NXP_SIUL2_PINMUX(0, 0, 212, 3, 0, 0)
#define PTG20_TRACE_ETM_D8              NXP_SIUL2_PINMUX(0, 0, 212, 7, 0, 0)
#define PTG21_EMIOS_2_CH21_Y_I          NXP_SIUL2_PINMUX(0, 0, 213, 0, 133, 1)
#define PTG21_EMIOS_2_CH21_Y_O          NXP_SIUL2_PINMUX(0, 0, 213, 2, 0, 0)
#define PTG21_FXIO_D20_I                NXP_SIUL2_PINMUX(0, 0, 213, 0, 172, 3)
#define PTG21_FXIO_D20_O                NXP_SIUL2_PINMUX(0, 0, 213, 3, 0, 0)
#define PTG21_TRACE_ETM_D9              NXP_SIUL2_PINMUX(0, 0, 213, 7, 0, 0)
#define PTG22_EMIOS_2_CH22_X_I          NXP_SIUL2_PINMUX(0, 0, 214, 0, 134, 1)
#define PTG22_EMIOS_2_CH22_X_O          NXP_SIUL2_PINMUX(0, 0, 214, 2, 0, 0)
#define PTG22_FXIO_D21_I                NXP_SIUL2_PINMUX(0, 0, 214, 0, 173, 3)
#define PTG22_FXIO_D21_O                NXP_SIUL2_PINMUX(0, 0, 214, 3, 0, 0)
#define PTG22_TRACE_ETM_D10             NXP_SIUL2_PINMUX(0, 0, 214, 7, 0, 0)
#define PTG23_EMIOS_2_CH23_X_I          NXP_SIUL2_PINMUX(0, 0, 215, 0, 135, 1)
#define PTG23_EMIOS_2_CH23_X_O          NXP_SIUL2_PINMUX(0, 0, 215, 2, 0, 0)
#define PTG23_FXIO_D22_I                NXP_SIUL2_PINMUX(0, 0, 215, 0, 174, 3)
#define PTG23_FXIO_D22_O                NXP_SIUL2_PINMUX(0, 0, 215, 3, 0, 0)
#define PTG23_TRACE_ETM_D11             NXP_SIUL2_PINMUX(0, 0, 215, 7, 0, 0)
#define PTG24_FXIO_D23_I                NXP_SIUL2_PINMUX(0, 0, 216, 0, 175, 3)
#define PTG24_FXIO_D23_O                NXP_SIUL2_PINMUX(0, 0, 216, 3, 0, 0)
#define PTG24_TRACE_ETM_D12             NXP_SIUL2_PINMUX(0, 0, 216, 7, 0, 0)
#define PTG25_FXIO_D24_I                NXP_SIUL2_PINMUX(0, 0, 217, 0, 176, 3)
#define PTG25_FXIO_D24_O                NXP_SIUL2_PINMUX(0, 0, 217, 3, 0, 0)
#define PTG25_TRACE_ETM_D13             NXP_SIUL2_PINMUX(0, 0, 217, 7, 0, 0)
#define PTG26_FXIO_D25_I                NXP_SIUL2_PINMUX(0, 0, 218, 0, 177, 3)
#define PTG26_FXIO_D25_O                NXP_SIUL2_PINMUX(0, 0, 218, 3, 0, 0)
#define PTG26_TRACE_ETM_D14             NXP_SIUL2_PINMUX(0, 0, 218, 7, 0, 0)
#define PTG27_FXIO_D26_I                NXP_SIUL2_PINMUX(0, 0, 219, 0, 178, 3)
#define PTG27_FXIO_D26_O                NXP_SIUL2_PINMUX(0, 0, 219, 3, 0, 0)
#define PTG27_TRACE_ETM_D15             NXP_SIUL2_PINMUX(0, 0, 219, 7, 0, 0)
#define PTG2_EIRQ10                     NXP_SIUL2_PINMUX(0, 0, 194, 0, 26, 5)
#define PTG2_EMIOS_1_CH18_Y_I           NXP_SIUL2_PINMUX(0, 0, 194, 0, 98, 3)
#define PTG2_EMIOS_1_CH18_Y_O           NXP_SIUL2_PINMUX(0, 0, 194, 3, 0, 0)
#define PTG2_LPUART14_TX_I              NXP_SIUL2_PINMUX(0, 0, 194, 0, 377, 3)
#define PTG2_LPUART14_TX_O              NXP_SIUL2_PINMUX(0, 0, 194, 1, 0, 0)
#define PTG3_EIRQ11                     NXP_SIUL2_PINMUX(0, 0, 195, 0, 27, 5)
#define PTG3_EMIOS_1_CH19_Y_I           NXP_SIUL2_PINMUX(0, 0, 195, 0, 99, 3)
#define PTG3_EMIOS_1_CH19_Y_O           NXP_SIUL2_PINMUX(0, 0, 195, 3, 0, 0)
#define PTG3_LPUART14_RX                NXP_SIUL2_PINMUX(0, 0, 195, 0, 201, 3)
#define PTG4_CMP2_OUT                   NXP_SIUL2_PINMUX(0, 0, 196, 4, 0, 0)
#define PTG4_EIRQ12                     NXP_SIUL2_PINMUX(0, 0, 196, 0, 28, 5)
#define PTG4_EMIOS_1_CH20_Y_I           NXP_SIUL2_PINMUX(0, 0, 196, 0, 100, 3)
#define PTG4_EMIOS_1_CH20_Y_O           NXP_SIUL2_PINMUX(0, 0, 196, 3, 0, 0)
#define PTG4_LPUART15_TX_I              NXP_SIUL2_PINMUX(0, 0, 196, 0, 378, 3)
#define PTG4_LPUART15_TX_O              NXP_SIUL2_PINMUX(0, 0, 196, 1, 0, 0)
#define PTG5_CMP2_RR_ACTIVE             NXP_SIUL2_PINMUX(0, 0, 197, 4, 0, 0)
#define PTG5_EIRQ13                     NXP_SIUL2_PINMUX(0, 0, 197, 0, 29, 5)
#define PTG5_EMIOS_1_CH21_Y_I           NXP_SIUL2_PINMUX(0, 0, 197, 0, 101, 3)
#define PTG5_EMIOS_1_CH21_Y_O           NXP_SIUL2_PINMUX(0, 0, 197, 3, 0, 0)
#define PTG5_LPUART15_RX                NXP_SIUL2_PINMUX(0, 0, 197, 0, 202, 3)
#define PTG6_EIRQ14                     NXP_SIUL2_PINMUX(0, 0, 198, 0, 30, 5)
#define PTG6_EMIOS_1_CH22_X_I           NXP_SIUL2_PINMUX(0, 0, 198, 0, 102, 3)
#define PTG6_EMIOS_1_CH22_X_O           NXP_SIUL2_PINMUX(0, 0, 198, 3, 0, 0)
#define PTG6_FXIO_D10_I                 NXP_SIUL2_PINMUX(0, 0, 198, 0, 162, 5)
#define PTG6_FXIO_D10_O                 NXP_SIUL2_PINMUX(0, 0, 198, 2, 0, 0)
#define PTG6_TRACE_ETM_CLKOUT           NXP_SIUL2_PINMUX(0, 0, 198, 7, 0, 0)
#define PTG7_EIRQ15                     NXP_SIUL2_PINMUX(0, 0, 199, 0, 31, 5)
#define PTG7_EMIOS_1_CH23_X_I           NXP_SIUL2_PINMUX(0, 0, 199, 0, 103, 3)
#define PTG7_EMIOS_1_CH23_X_O           NXP_SIUL2_PINMUX(0, 0, 199, 3, 0, 0)
#define PTG7_FXIO_D11_I                 NXP_SIUL2_PINMUX(0, 0, 199, 0, 163, 7)
#define PTG7_FXIO_D11_O                 NXP_SIUL2_PINMUX(0, 0, 199, 2, 0, 0)
#define PTG7_TRACE_ETM_D0               NXP_SIUL2_PINMUX(0, 0, 199, 7, 0, 0)
#define PTG8_CAN4_TX                    NXP_SIUL2_PINMUX(0, 0, 200, 1, 0, 0)
#define PTG8_EIRQ24                     NXP_SIUL2_PINMUX(0, 0, 200, 0, 40, 4)
#define PTG8_FXIO_D12_I                 NXP_SIUL2_PINMUX(0, 0, 200, 0, 164, 5)
#define PTG8_FXIO_D12_O                 NXP_SIUL2_PINMUX(0, 0, 200, 2, 0, 0)
#define PTG9_CAN4_RX                    NXP_SIUL2_PINMUX(0, 0, 201, 0, 4, 5)
#define PTG9_EIRQ25                     NXP_SIUL2_PINMUX(0, 0, 201, 0, 41, 4)

#endif /* _ZEPHYR_DTS_BINDING_MCXE31BMPB_WRAPPER_ */
